app/controllers/api/v1/finders_controller.rb

      def set_finder
        @finder = Finder.find(params[:id])
---
SELECT "finders".* FROM "finders" WHERE "finders"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]