app/controllers/api/v1/finders_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."finder_id" IN (SELECT "finders"."id" FROM "finders")
---
  def index
    @finders = policy_scope(Finder)

    @movies = Movie.where(finder_id: @finders)

INSERT INTO "finders" ("release", "duration", "language", "rating", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    # render json: { error: "No movie found" }, status: :not_found if finder_params[:rating].nil?
    find_genre_id

    hash_params = { min_release: finder_params[:release],
                    min_duration: finder_params[:duration],
                    vote_count: 100,
                    min_rating: finder_params[:rating].min,
                    max_rating: finder_params[:rating].max }

    matching_preferences
    choice_count

    find_country(hash_params[:min_release],
                 hash_params[:min_duration],
                 hash_params[:vote_count],
                 hash_params[:min_rating],
                 hash_params[:max_rating],
                 hash_params[:genre])

    @finder = Finder.new({ 'release' => hash_params[:min_release],
                           'duration' => hash_params[:min_duration],
                           'language' => ["French", hash_params[:movie_title]],
                           'rating' => [hash_params[:min_rating], hash_params[:max_rating]] })
    @finder.user = current_user
    authorize @finder

    if @finder.save

SELECT "finders".* FROM "finders" WHERE "finders"."id" = $1 LIMIT $2  [["id", 9999], ["LIMIT", 1]]
---
  def set_finder
    @finder = Finder.find(params[:id])

SELECT "preferences".* FROM "preferences" WHERE "preferences"."name" = $1  [["name", "Bob"]]
---
  def matching_preferences
    # find the matching preferences
    i = 0
    j = (finder_params['attendees'].count)
    @preferences = []
    while i < j

      # find the name in the params for i
      name = finder_params['attendees'][i]
      # find the name of the user in preference for i
      tmp = Preference.where(name: name)[0][:content]
      # creating a temporary varaible to create an array to sock the preferences
      tmp.each { |string| @preferences.append(string) }

INSERT INTO "movies" ("title", "overview", "vote_average", "finder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def upper_limit

    if @body.nil? || @body['results'].count.zero?
      empty_request # call emtpy request method in parent
    else
      @body['results'].count < 10 ? (upper_limit = @body['results'].count) : (upper_limit = 10)
      i = 0
      # while i < 10
      while i < upper_limit
        movie = Movie.new({ 'finder_id' => @finder.id,
                            'title' => @body['results'][i]['original_title'],
                            'overview' => @body['results'][i]['overview'],
                            'vote_average' => @body['results'][i]['vote_average'] })
        movie.save