app/controllers/api/v1/finders_controller.rb

  def create
    @min_release = finder_params[:release][0..3].to_i
    @min_duration = finder_params[:duration].to_i
    @vote_count = 2500
    @min_rating = finder_params[:rating].first.to_i
    @max_rating = finder_params[:rating][1].to_i

    # find the matching preferences
# https://stackoverflow.com/questions/5128200/how-to-count-identical-string-elements-in-a-ruby-array
          i = 0
          j = (finder_params["attendees"].count - 1)
          @preferences = []
      while i < j
        # find the name of the tteendes and extract them
        name = finder_params["attendees"][i]
        tmp = Preference.where(name: name)[0][:content]
        tmp.each{|string| @preferences.append(string) }
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."name" = $1  [["name", "Pierre"]]

                          "rating"=>[@min_rating, @max_rating] })
    @finder.user = current_user
    authorize @finder
    if @finder.save
---
INSERT INTO "finders" ("release", "duration", "language", "rating", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

                        "title"=> @body["results"][i]["original_title"],
                        "overview"=> @body["results"][i]["overview"],
                        "vote_average"=> @body["results"][i]["vote_average"] })
        movie.save
---
INSERT INTO "movies" ("title", "overview", "vote_average", "finder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_finder
    @finder = Finder.find(params[:id])
---
SELECT "finders".* FROM "finders" WHERE "finders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]