app/controllers/api/v1/preferences_controller.rb

INSERT INTO "preferences" ("content", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "{Action}"], ["name", "QwertyUser"], ["user_id", 1], ["created_at", "2021-01-31 12:19:26.908141"], ["updated_at", "2021-01-31 12:19:26.908141"]]
---
  def create
    @preference = Preference.new(preference_params)
    # binding.pry
    @preference.user = current_user
    authorize @preference
    if @preference.save

SELECT "preferences".* FROM "preferences" WHERE "preferences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_preference
    # @preference = preference.where(name: params[:id])
    @preference = Preference.find(params[:id])